cask_args appdir: '/Applications'

brew "brew-cask-completion"

brew "binutils"
brew "coreutils"
brew "findutils"
brew "moreutils"

brew "bash"
brew "bash-completion"
brew "bash-git-prompt"

brew "git"
brew "git-extras"
brew "git-lfs"

brew "homebrew/dupes/apple-gcc42"
brew "autoconf"
brew "automake"

tap "homebrew/science"
tap "homebrew/python"

brew "python"
brew "python3"

brew "gpg"
brew "gpg2"
brew "the_silver_searcher"
brew "wget"
brew "tree"
brew "nmap"

brew "libtiff"
brew "libjpeg"
brew "imagemagick", args: ["--with-webp --with-fftw --with-librsvg --with-x11"]
brew "graphviz", args: ["--with-librsvg --with-x11"]
brew "freetype"

brew "mas"
mas "1Password", id: 443987910
mas "Twitter", id: 409789998
mas "Moom", id: 419330170
mas "Pomodoro Times", id: 872515009
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Reeder 3", id: 880001334

cask "dropbox"
cask "onedrive"
cask "google-drive"
cask "iterm2"
cask "little-snitch"
cask "alfred"
cask "caffeine"
cask "cheatsheet"
cask "evernote"
cask "flux"
cask "google-chrome"
cask "grammarly"
cask "grandperspective"
cask "pgadmin4"
cask "selfcontrol"
cask "skitch"
cask "skype"
cask "slack"
cask "sublime-text"
cask "subtitle-master"
cask "the-unarchiver"
cask "tower"
cask "tunnelbear"
cask "vagrant"
cask "virtualbox"

cask "lastfm"
cask "fullcontact"
cask "go2shell"
cask "cyberduck"
cask "dash"
cask "docker"
cask "cleanmymac"
cask "arduino"
cask "firefox"
cask "fluid"
cask "microsoft-office"
cask "vlc"
cask "spotify"

cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzipql"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
