cask_args appdir: '/Applications'

brew 'brew-cask-completion'

brew 'binutils'
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'

brew 'git'
brew 'git-extras'
brew 'git-lfs'

brew 'homebrew/dupes/apple-gcc42'
brew 'autoconf'
brew 'automake'

brew 'nvm'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'yarn'

brew 'exa'
brew 'gpg'
brew 'gpg2'
brew 'nmap'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget'

brew 'libtiff'
brew 'libjpeg'
brew 'imagemagick', args: ['--with-webp --with-fftw --with-librsvg --with-x11']
brew 'graphviz', args: ['--with-librsvg --with-x11']
brew 'freetype'

brew 'postgresql'
brew 'redis'

brew 'mas'
mas '1Password', id: 443_987_910
mas 'Bear', id: 1_091_189_122
mas 'Keynote', id: 409_183_694
mas 'Moom', id: 419_330_170
mas 'Numbers', id: 409_203_825
mas 'Reeder 3', id: 880_001_334
mas 'Things 3', id: 904_280_696
mas 'Twitter', id: 409_789_998
mas 'Xcode', id: 497_799_835

tap 'caskroom/fonts'
tap 'caskroom/versions'

cask 'alfred'
cask 'caffeine'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'endurance'
cask 'firefoxnightly'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'grammarly'
cask 'grandperspective'
cask 'iterm2'
cask 'licecap'
cask 'little-snitch'
cask 'microsoft-office'
cask 'muzzle'
cask 'ngrok'
cask 'onedrive'
cask 'pgadmin4'
cask 'selfcontrol'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'subtitle-master'
cask 'telegram'
cask 'the-unarchiver'
cask 'toggl'
cask 'tower'
cask 'tunnelbear'
cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'webpquicklook'
